const moment = require('moment');
moment.locale('zh-cn');
const courseData = {
  "courseArrange": [
    [
      [
        "创业基础",
        "西-新B308",
        "xx老师",
        "3-13周",
        "讲课学时"
      ],
      [
        "电子技术-II",
        "西-新F413",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      [
        "英语（四）2",
        "西-新A304",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      [
        "信号与系统",
        "西-新J405（一体机）",
        "xx老师",
        "1-15周",
        "讲课学时"
      ],
      [
        "多媒体技术及应用（公共）",
        "西1-0711",
        "xx老师",
        "1-11周",
        "讲课学时",
        "多媒体技术及应用（公共）",
        "西1-0801",
        "xx老师",
        "第11周",
        "讲课学时"
      ],
      null,
      null
    ],
    [
      [
        "工程光学",
        "西-新F413",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      [
        "计算方法",
        "西-新J303",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      [
        "可靠性工程",
        "西-新J209",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      [
        "创业基础",
        "西-新B308",
        "xx老师",
        "2-13单周",
        "讲课学时"
      ],
      null,
      null,
      null
    ],
    [
      [
        "英语（四）2",
        "西1-1005",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      [
        "体育（四）8",
        "西区操场",
        "xx老师",
        "1-17周",
        "讲课学时"
      ],
      [
        "工程光学",
        "西-新F411",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      null, [
        "计算方法",
        "西-新J303",
        "xx老师",
        "2-16双周",
        "讲课学时",
        "毛、中、特概论-I3",
        "西-新J303",
        "xx老师",
        "1-13单周",
        "讲课学时"
      ],
      null,
      null
    ],
    [
      [
        "毛、中、特概论-I3",
        "西-新J303",
        "xx老师",
        "1-14周",
        "讲课学时"
      ],
      [
        "信号与系统",
        "西-新J405（一体机）",
        "xx老师",
        "1-15单周",
        "讲课学时"
      ],
      null, [
        "电子技术-II",
        "西-新F413",
        "xx老师",
        "1-16周",
        "讲课学时"
      ],
      null,
      null,
      null
    ],
    [
      null,
      null,
      null,
      null, [
        "毛、中、特概论-I3",
        "西-新J303",
        "xx老师",
        "第12周",
        "讲课学时"
      ],
      null,
      null
    ]
  ],
  "noArrangement": [
    [
      "课程号",
      "课程名称",
      "课序号",
      "任课教师",
      "合班",
      "上课周次",
      "星期",
      "上课地点"
    ],
    [
      "0501G02W4",
      "课程设计（工程光学）",
      "4",
      "xx老师",
      "测控13-4",
      "第18周",
      "",
      ""
    ],
    [
      "1900G02W4",
      "电工电子实习（1周）",
      "5",
      "xx老师",
      "测控13-4",
      "第2周",
      "",
      ""
    ],
    [
      "1901G42W4",
      "课程设计（数电）",
      "7",
      "xx老师",
      "测控13-4",
      "第20周",
      "",
      ""
    ]
  ],
  "cookie": "JSESSIONID=24C7BEC6295AB853F18EAE08D6C99BCB.LB01"
};


const gradeData = {
  "data": [
    [
      "2017",
      "春",
      "0000A20N0",
      "学术基本要素-专业论文写作（网络）（公共）",
      "1",
      "公共基础课[2012]",
      "87",
      "2",
      "14",
      "任选",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "0000B21N0",
      "个人理财规划（网络）（人文）",
      "1",
      "人文、社科、经管类选修课[2012]",
      "67",
      "2",
      "11",
      "任选",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "0501C02W4",
      "工程光学",
      "2",
      "学科基础课",
      "80",
      "4",
      "60",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "0501C10W4",
      "信号与系统",
      "2",
      "学科基础课",
      "89",
      "2",
      "42",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "0501C11W4",
      "可靠性工程",
      "1",
      "学科基础选修课",
      "70",
      "2",
      "30",
      "限选",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "0501G02W4",
      "课程设计（工程光学）",
      "3",
      "实践教学环节",
      "良",
      "1",
      "1",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "0701C18S4",
      "计算方法",
      "1",
      "学科基础课",
      "73",
      "2",
      "42",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "1701BA2W4",
      "创业基础",
      "2",
      "人文、社科、经管类素质课[2010]（W）",
      "优秀",
      "2",
      "30",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "1900G02W4",
      "电工电子实习（1周）",
      "4",
      "实践教学环节",
      "优秀",
      "1",
      "1",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "1901C42W4",
      "电子技术-II",
      "4",
      "学科基础课",
      "83",
      "3",
      "64",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "1901G42W4",
      "课程设计（数电）",
      "6",
      "实践教学环节",
      "良",
      "1",
      "1",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "7101A01W4",
      "英语（四）",
      "49",
      "公共基础课[2010]（W）",
      "77",
      "4",
      "60",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "7201BA1W4",
      "毛、中、特概论-I",
      "24",
      "人文、社科、经管类素质课[2010]（W）",
      "79",
      "3",
      "36",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ],
    [
      "2017",
      "春",
      "7301A01W4",
      "体育（四）",
      "38",
      "公共基础课[2010]（W）",
      "85",
      "1.5",
      "30",
      "必修",
      "正常",
      "正常考试",
      "及格"
    ]
  ],
  "gradeTerm": "2017春",
  "cookie": "JSESSIONID=24C7BEC6295AB853F18EAE08D6C99BCB.LB01"
}

function getExamData() {
  moment().utcOffset(8);
  const today = moment().utcOffset(8).add(2, 'hours').format('YYYY-MM-DD HH:mm');
  const tomoorow = moment().utcOffset(8).add(1, 'days').format('YYYY-MM-DD HH:mm');
  const examData = {
    "data": [{
      "examCourse": "计算机控制技术与系统",
      "time": `${tomoorow}--${moment().utcOffset(8).add(2, 'hours').format('HH:mm')}`,
      "position": "西区 新教学楼 西-新F305",
      "info": "正常考试"
    }, {
      "examCourse": "自动检测技术及仪表",
      "time": `${today}--${moment().utcOffset(8).add(4, 'hours').format('HH:mm')}`,
      "position": "西区 新教学楼 西-新F303",
      "info": "重考"
    }, {
      "examCourse": "毛、中、特概论-II",
      "time": "2015-12-20 13:30--15:00",
      "position": "西区 新教学楼 西-新A514",
      "info": "正常考试"
    }, {
      "examCourse": "误差理论与数据处理",
      "time": "2015-12-18 13:30--15:10",
      "position": "西区 新教学楼 西-新B408",
      "info": "正常考试"
    }, {
      "examCourse": "自动控制原理",
      "time": "2015-12-16 13:30--15:10",
      "position": "西区 新教学楼 西-新B502",
      "info": "重考"
    }, {
      "examCourse": "传感技术",
      "time": "2015-12-16 10:10--11:50",
      "position": "西区 新教学楼 西-新B308",
      "info": "正常考试"
    }, {
      "examCourse": "专业外语（测控）",
      "time": "2015-12-15 10:10--11:50",
      "position": "西区 新教学楼 西-新B502",
      "info": "正常考试"
    }, {
      "examCourse": "单片机原理",
      "time": "2015-12-14 10:10--11:50",
      "position": "西区 新教学楼 西-新B312",
      "info": "正常考试"
    }, {
      "examCourse": "Matlab",
      "time": "2015-11-17 18:00--19:40",
      "position": "西区 西区一号楼 计算中心机房西1-0604",
      "info": "正常考试"
    }, {
      "examCourse": "微机原理",
      "time": "2015-11-10 18:00--19:40",
      "position": "西区 西区一号楼 计算中心机房西1-0604",
      "info": "正常考试"
    }]
  }
  return examData;
};

exports.courseData = courseData;
exports.gradeData = gradeData;
exports.getExamData = getExamData;
